# -*- coding: utf-8 -*-
"""
Created on Wed Jul  7 09:44:33 2021

@author: user15
"""
# =============================================================================
# s = "チューリップは{}と{}と{}でした。"
# print(s.format("赤", "青","黄色"))
# print(s)
# s = s.format("赤", "青","黄色")
# print(s)
# =============================================================================

# =============================================================================
# name = "高橋"
# age = 23
# point = 102.5
# s = "{}選手、年齢{}、得点{}でした。"
# text = s.format(name, age, point)
# print(text)
# 
# =============================================================================
# =============================================================================
# name = '高橋'
# age = 23
# point = 102.5
# text = f"{name}選手、年齢{age}、得点{point}でした。"
# print("f string: ", text)
# =============================================================================
# =============================================================================
# ## Puts comma as thousand divider
# tokyo = 123456000
# kyoto = 53900
# s = '東京{:,}、京都{:,}'
# print("format: ",s.format(tokyo, kyoto))
# 
# print("f string:",f"東京{tokyo:,}、京都{kyoto:,}")
# 
# 
# =============================================================================
# =============================================================================
# length = 25.36 #it performs round()
# thickness = 5.62
# ## f ==> float 
# text = f"長さ{length:.1f}cm、厚み{thickness:.0f}mm"
# print("fstring:",text)
# 
# s = "長さ{:.1f}cm、厚み{:.0f}mm"
# s.format(length, thickness)
# print("format:", s)
# 
# # Combine , and .
# num = 2345.032
# print(f"{num:,.2f}")
# 
# =============================================================================

num1 = 123.4
num2 = 56.9
num3 = 3040.1
## formats from right ??
print(f"{num1:>10.1f}")
print(f"{num2:>10.1f}")
print(f"{num3:>10.1f}")

## from C sprintf
print("%s %s%s" %('Hello', 'Python', 3.6,))