# -*- coding: utf-8 -*-
import math
tate_count = 0

tate = int(input("タテ:11 "))
yoko = int(input("ヨコ:32 "))

patterns = []
letters_cnt = []
input_cnt = 0
while True:
    pat = input("模様を入力してください(空白を入力して終了) \n")
    
    if pat == "":
        break
    
    letters_cnt.append(len(pat))
    patterns.append(pat)
    input_cnt += 1
    
cnt = 0
for i in range(0, tate):
    yoko_r = math.floor(yoko / letters_cnt[cnt])
    
    for j in range(yoko_r):
        if cnt == input_cnt -1:
            patterns[cnt].split("")
        else:
            print(patterns[cnt] + " ", end="")
      
    print()
    cnt += 1
    if cnt == input_cnt:
        cnt = 0
        
'''
演習13
■ 仕様
タテxヨコの 2 つの値と模様を入力し、入力した大きさで模様を繰り返し表示する長方形を描くプログラムを作成
してください。 
■ 実行画面
------------------------------------
タテ:11
ヨコ:32 
模様を入力してください(空白を入力して終了) 
■□□□
□■□■
□□■□
□■□■
結果: 

■□□□■□□□■□□□■□□□■□□□■□□□■□□□■□□□ 
□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■ 
□□■□□□■□□□■□□□■□□□■□□□■□□□■□□□■□ 
□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■ 
■□□□■□□□■□□□■□□□■□□□■□□□■□□□■□□□ 
□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■ 
□□■□□□■□□□■□□□■□□□■□□□■□□□■□□□■□ 
□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■ 
■□□□■□□□■□□□■□□□■□□□■□□□■□□□■□□□ 
□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■ 
□□■□□□■□□□■□□□■□□□■□□□■□□□■□□□■□
------------------------------------
'''
