# -*- coding: utf-8 -*-
'''
演習9
■ 仕様 
住所録を管理するコンソールアプリケーションを作成してください。 
実行すると、ウェルカムメッセージとメニューを表示します。
○ 画面イメージ 
------------------------------------
住所管理アプリケーションへようこそ。
**********メニュー**********
1)住所録追加 2)住所録表示 3)住所録検索 9)終了:
------------------------------------
● 住所録追加 
この機能は、名前、住所、電話番号、メールアドレスを住所録としてリストに登録します。なお、名前、住所、
電話番号は必須項目とします。
○ 画面イメージ 
------------------------------------
住所録に登録するデータを入力してください。
名前:前園
住所:岐阜県各務原市 
電話番号:058-321-4567 
メールアドレス:maezono@XXX.YYY 
登録しました。 
------------------------------------
その後、メニューを表示します。
● 住所録表示 
この機能は、指定した番号の住所録データを画面に表示します。
○ 画面イメージ
------------------------------------
表示するアドレスの番号を入力してください。(1-5):5
名前:前園
住所:岐阜県各務原市 
電話番号:058-321-4567 
メールアドレス:maezono@XXX.YYY 
------------------------------------
アドレスの番号は 1~件数とします。 
その後、メニューを表示します。

● 住所録検索 
この機能は、指定した文字列を含む住所録データを画面に表示します。
○ 画面イメージ 
------------------------------------
検索するデータを入力してください:愛知県
名前:山田 
住所:愛知県名古屋市 
電話番号:090-1111-xxxx 
メールアドレス:abc@xxx.yyy

名前:佐藤 
住所:愛知県犬山市 
電話番号:080-0000-xxxx 
メールアドレス:xyz@xxx.yyy
2 件のデータが見つかりました。 
------------------------------------
その後、メニューを表示します。
● 終了
○ 画面イメージ
------------------------------------
ありがとうございました。 
------------------------------------
その後、アプリケーションを終了します。
'''
